#+TITLE: August 31, 2019 - September 12, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-08-31 Sat>
  :wpd-akshay196: 1
  :wpd-gandalfdwite: 1
  :wpd-sandeepk: 1
  :END:
** akshay196
*** DONE Automate the Boring Stuff with Python - Part I [13/13]
    CLOSED: [2019-09-12 Thu 21:25]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   11.65
    :OWNER: akshay196
    :ID: READ.1567504631
    :TASKID: READ.1567504631
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-12 Thu 20:45]--[2019-09-12 Thu 21:25] =>  0:40
    CLOCK: [2019-09-12 Thu 07:10]--[2019-09-12 Thu 08:25] =>  1:15
    CLOCK: [2019-09-11 Wed 21:29]--[2019-09-11 Wed 22:41] =>  1:12
    CLOCK: [2019-09-11 Wed 07:59]--[2019-09-11 Wed 08:29] =>  0:30
    CLOCK: [2019-09-11 Wed 06:55]--[2019-09-11 Wed 07:33] =>  0:38
    CLOCK: [2019-09-10 Tue 08:06]--[2019-09-10 Tue 08:56] =>  0:50
    CLOCK: [2019-09-09 Mon 16:11]--[2019-09-09 Mon 17:03] =>  0:52
    CLOCK: [2019-09-08 Sun 21:42]--[2019-09-08 Sun 22:37] =>  0:55
    CLOCK: [2019-09-06 Fri 22:03]--[2019-09-06 Fri 22:37] =>  0:34
    CLOCK: [2019-09-05 Thu 21:46]--[2019-09-05 Thu 23:00] =>  1:14
    CLOCK: [2019-09-05 Thu 08:15]--[2019-09-05 Thu 09:01] =>  0:46
    CLOCK: [2019-09-04 Wed 20:23]--[2019-09-04 Wed 21:36] =>  1:13
    CLOCK: [2019-09-04 Wed 08:19]--[2019-09-04 Wed 09:02] =>  0:43
    CLOCK: [2019-09-03 Tue 21:30]--[2019-09-03 Tue 21:47] =>  0:17
    :END:
    - [X] Chapter  1. Python Basics                                           (1h)
    - [X] Chapter  2. Flow Control                                            (1h)
    - [X] Chapter  3. Functions                                               (1h)
    - [X] Chapter  4. Lists                                                   (1h)
    - [X] Chapter  5. Dictionaries and Structuring Data                       (1h)
    - [X] Chapter  6. Manipulating Strings                                    (1h)
    - [X] Chapter  7. Pattern Matching with Regular Expressions               (1h)
    - [X] Chapter  8. Reading and Writing Files                               (1h)
    - [X] Chapter  9. Organizing Files                                        (1h)
    - [X] Chapter 10. Debugging                                               (1h)
    - [X] Chapter 11. Web Scraping                                            (1h)
    - [X] Chapter 12. Working with Excel Spreadsheets                         (1h)
    - [X] Chapter 13. Working with PDF and word Documents                     (1h)

** gandalfdwite
*** DONE Kubernetes Security [1/1]
    CLOSED: [2019-09-08 Sun 14:37]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   3.17
    :OWNER: gandalfdwite
    :ID: OPS.1567104795
    :TASKID: OPS.1567104795
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-06 Fri 23:27]--[2019-09-07 Sat 02:37] =>  3:10
    :END:
    - [X] Live Online Training      ( 3h )
      - [[https://learning.oreilly.com/live-training/courses/kubernetes-security-attacking-and-defending-kubernetes/0636920295549/][Link Here]]
*** DONE Using Prometheus for Black Box monitoring [1/1]
    CLOSED: [2019-09-06 Fri 23:27]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   3.00
    :OWNER: gandalfdwite
    :ID: OPS.1567104720
    :TASKID: OPS.1567104720
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-05 Thu 21:30]--[2019-09-06 Fri 00:30] =>  3:00
    :END:
    - [X] Live Online Training       ( 3h )
      - [[https://learning.oreilly.com/live-training/courses/spotlight-on-cloud-using-prometheus-for-black-box-monitoring-with-aaron-wieczorek/0636920296447/][Link Here]]
*** DONE Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi) [4/4]
    CLOSED: [2019-09-12 Thu 22:55]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:   7.70
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-12 Thu 21:41]--[2019-09-12 Thu 22:40] =>  0:59
    CLOCK: [2019-09-11 Wed 22:53]--[2019-09-12 Thu 00:40] =>  1:47
    CLOCK: [2019-09-10 Tue 20:48]--[2019-09-10 Tue 22:00] =>  1:12
    CLOCK: [2019-09-04 Wed 23:24]--[2019-09-05 Thu 00:34] =>  1:10
    CLOCK: [2019-09-03 Tue 21:34]--[2019-09-03 Tue 23:07] =>  1:33
    CLOCK: [2019-09-02 Mon 13:34]--[2019-09-02 Mon 14:35] =>  1:01
    :END:
    - [X] 14. Hashing                          ( 2h)
    - [X] 15. String Algorithms                ( 2h)
    - [X] 16. Algorithms Design Techniques     ( 1h)
    - [X] 17. Greedy Algorithms                ( 2h)

** sandeepk
*** DONE Blog post to write [1/1]
    :PROPERTIES:
    :ESTIMATED: 2h
    :ACTUAL:   1.58
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-03 Tue 23:30]--[2019-09-04 Wed 00:00] =>  0:30
    CLOCK: [2019-09-02 Mon 18:10]--[2019-09-02 Mon 18:35] =>  0:25
    CLOCK: [2019-09-01 Sun 16:20]--[2019-09-01 Sun 17:00] =>  0:40
    :END:
    - [X] Blog on Chanakya Neeti book review. (2h)
*** IN_PROGRESS [#B] Dive into Pyhton3 [1/4]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:   4.00
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-09 Mon 23:30]--[2019-09-10 Tue 00:30] =>  1:00
    CLOCK: [2019-09-05 Thu 21:30]--[2019-09-05 Thu 22:00] =>  0:30
    CLOCK: [2019-09-03 Tue 21:30]--[2019-09-03 Tue 23:00] =>  1:30
    CLOCK: [2019-09-02 Mon 20:30]--[2019-09-02 Mon 21:30] =>  1:00
    :END:
    - [X]  Chapter 6 - Closures & Generators   (3h)
    - [ ]  Chapter 7 - Classes & Iterators     (3h)
    - [ ]  Chapter 8 - Advanced Iterators      (3h)
    - [ ]  Chapter 9 - Unit Testing            (2h)
